RepXcel/nRF52832-Embedded-Application/src/main.c
#define DEAD_BEEF                           0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define OSTIMER_WAIT_FOR_QUEUE              2                                       /**< Number of ticks to wait for the timer queue to be ready */

#define NOTIFICATION_INTERVAL               20                                      /**< Notificatio update interval */

#define TWI_INSTANCE_ID                     0                                       /**< I2C driver instance */
#define MAX_PENDING_TRANSACTIONS            32                                      /**< Maximal number of pending I2C transactions */
#define ACCEl_BUFFER_SIZE                   17                                      /**< Buffer size */
#define ACCEL_ERROR_THRESHOLD               2.0f                                    /**< Values below threshold will be treated as negligible acceleration*/
#define ACCEL_PERIOD                        0.05f                                   /**< Accel sampling period */
#define SAMPLE_TOLERANCE                    2                                       /**< Number of samples to use for velocity when valid sample is detected*/

#define MG_TO_CMPS(MG)                      MG * 0.0981f                            /**< Converts from mg to cm/s^2 (centimeters per second)*/

#define LIS2DH12_INT1                                25
#define LIS2DH12_INT2                                26
#define LIS2DH12_CS                                  27
#define LIS2DH12_SA0                                 28
#define LIS2DH12_SDA                                 29
#define LIS2DH12_SCL                                 30

BLE_BAS_DEF(m_bas);                                                                 /**< Battery service instance. */
BLE_HRS_DEF(m_hrs);                                                                 /**< Heart rate service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
NRF_TWI_MNGR_DEF(m_nrf_twi_mngr, MAX_PENDING_TRANSACTIONS, TWI_INSTANCE_ID);        /**< TWI manager instance. */
NRF_TWI_SENSOR_DEF(m_nrf_twi_sensor, &m_nrf_twi_mngr, ACCEl_BUFFER_SIZE);                 /**< TWI sensor instance. */
LIS2DH12_INSTANCE_DEF(m_lis2dh12, &m_nrf_twi_sensor, LIS2DH12_BASE_ADDRESS_HIGH);    /**< LIS2DH12 accel instance. */
BLE_WORKOUT_DATA_DEF(m_workout_data);

static uint16_t         m_conn_handle = BLE_CONN_HANDLE_INVALID;                    /**< Handle of the current connection. */
static lis2dh12_data_t  m_accel_data[ACCEl_BUFFER_SIZE] = {0};                      /**< Buffer for accel samples */
static workout_data_t   m_velocity =  {0};                                         /**< Velocity value*/
static bool             m_data_ready = false;                                       /**< Data ready flag*/  

static sensorsim_cfg_t   m_battery_sim_cfg;                                         /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;                                       /**< Battery Level sensor simulator state. */

static ble_uuid_t m_adv_uuids[] = {                                                 /**< Universally unique service identifiers. */
    {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE},
};

static ble_uuid_t m_sr_uuids[] = {
    {CUSTOM_SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}               /**< Universally unique service identifiers. */
};

static TimerHandle_t m_battery_timer;                               /**< Definition of battery timer. */
static TimerHandle_t m_ble_notif_timer;

#if NRF_LOG_ENABLED
static TaskHandle_t m_logger_thread;                                /**< Definition of Logger thread. */
#endif
static TaskHandle_t m_accel_thread;

static void advertising_start(void * p_erase_bonds);

static void update_velocity(){
    uint8_t samples_to_read = 0;
    for (uint8_t i = 0; i < ACCEl_BUFFER_SIZE; i++){
        int16_t accel_x_mg = m_accel_data[i].x >> 4;
        int16_t accel_y_mg = m_accel_data[i].y >> 4;
        int16_t accel_z_mg = m_accel_data[i].z >> 4;
        float accel_magnitude_mg = sqrt(accel_x_mg * accel_x_mg + accel_y_mg * accel_y_mg + accel_z_mg * accel_z_mg);
        float accel_magnitude_cmpss = MG_TO_CMPS(accel_magnitude_mg);
        if (accel_magnitude_cmpss > ACCEL_ERROR_THRESHOLD){
            samples_to_read = SAMPLE_TOLERANCE;
        }
        if(samples_to_read){
            m_velocity.data += accel_magnitude_cmpss * ACCEL_PERIOD;
        } else {
            m_velocity.data = 0;
            samples_to_read = MAX(samples_to_read - 1, 0);
        }
        // NRF_LOG_INFO("i:%d %d %d %d", i, accel_x_mg, accel_y_mg, accel_z_mg);
        // NRF_LOG_INFO("Accel magnitude (mg): " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(accel_magnitude_mg));
        // NRF_LOG_INFO("Accel magnitude (cm/s): " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(accel_magnitude_cmpss));
        NRF_LOG_INFO("Velocity: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(m_velocity.data));
    }
}

static void accel_thread(void * arg)
{
    UNUSED_PARAMETER(arg);
    ret_code_t err_code;

    LIS2DH12_DATA_CFG(m_lis2dh12, LIS2DH12_ODR_200HZ, false, true, true, true, LIS2DH12_SCALE_2G, true);
    LIS2DH12_FIFO_CFG(m_lis2dh12, true, LIS2DH12_STREAM, false, ACCEl_BUFFER_SIZE);
    LIS2DH12_INT1_PIN_CFG(m_lis2dh12, false, false, false, false, true, false, true, false);
    LIS2DH12_FILTER_CFG(m_lis2dh12, LIS2DH12_FILTER_MODE_NORMAL, LIS2DH12_FILTER_FREQ_1, true, false, false, false);
    
    err_code = lis2dh12_cfg_commit(&m_lis2dh12);
    
    APP_ERROR_CHECK(err_code);
    
    for(;;)
    {
        __WFI();
        if(m_data_ready) {
            err_code = lis2dh12_data_read(&m_lis2dh12, NULL, m_accel_data, ACCEl_BUFFER_SIZE);
            APP_ERROR_CHECK(err_code);
            update_velocity();

            bsp_board_led_off(BSP_BOARD_LED_1);
            m_data_ready = false;
        }
    }
}

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


